In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plot

In [9]:
data = {'prod':['A','B','C','D','B','C','A','D','B','D','C'],
        'city':['Delhi','Noida','pune','Delhi','Mumbai','Noida',
                'Mumbai','Delhi','Delhi','Noida','Pune'],
        'Availabllity':np.random.choice(['Y','N'],11)}
df = pd.DataFrame(data)
df

   prod    city Availabllity
0     A   Delhi            Y
1     B   Noida            Y
2     C    pune            Y
3     D   Delhi            Y
4     B  Mumbai            N
5     C   Noida            Y
6     A  Mumbai            N
7     D   Delhi            Y
8     B   Delhi            Y
9     D   Noida            N
10    C    Pune            N

In [10]:
df.dtypes

prod            object
city            object
Availabllity    object
dtype: object

In [18]:
#all are in object -ml dont take object
#find and replace
#map ,replace or np.where
#changing data type to integer
df['Availabllity'].value_counts()

Series([], Name: Availabllity, dtype: int64)

In [19]:
df['Availabllity'] = df['Availabllity'].replace({'Y':1,'N':0})
#df['Availabllity'] = df['Availabllity'].map({'Y ':1,'N':0})
df['Availabllity'].value_counts()

Series([], Name: Availabllity, dtype: int64)

In [20]:
df.dtypes

prod             object
city             object
Availabllity    float64
dtype: object

In [21]:
#2)label encoder

from sklearn.preprocessing import LabelEncoder

In [22]:
df['city'].value_counts()

Delhi     4
Noida     3
Mumbai    2
pune      1
Pune      1
Name: city, dtype: int64

In [23]:
lb = LabelEncoder()  #object of labelencoder
df['city'] = lb.fit_transform(df['city'])
df['city'].value_counts()

0    4
2    3
1    2
4    1
3    1
Name: city, dtype: int64

In [24]:
 df.dtypes

prod             object
city              int32
Availabllity    float64
dtype: object

In [25]:
df['prod'].value_counts()

B    3
C    3
D    3
A    2
Name: prod, dtype: int64

In [26]:
df.head()

  prod  city  Availabllity
0    A     0           NaN
1    B     2           NaN
2    C     4           NaN
3    D     0           NaN
4    B     1           NaN

In [27]:
#get dummies
dfd = pd.get_dummies(data=df,columns=['prod'])
dfd.head()

   city  Availabllity  prod_A  prod_B  prod_C  prod_D
0     0           NaN       1       0       0       0
1     2           NaN       0       1       0       0
2     4           NaN       0       0       1       0
3     0           NaN       0       0       0       1
4     1           NaN       0       1       0       0

In [28]:
###Scaling

In [30]:
data = {'Age':[24,29,40,48,43,54,53],
       'Income':[20000,34000,47000,55000,65000,90000,170000]}
df1 = pd.DataFrame(data)
df1

   Age  Income
0   24   20000
1   29   34000
2   40   47000
3   48   55000
4   43   65000
5   54   90000
6   53  170000

In [31]:
from sklearn.preprocessing import StandardScaler

In [33]:
sc = StandardScaler()#objesct of standard scaler
df_sc = sc.fit_transform(df1)
print(df_sc)#scalled data

[[-1.64600976 -1.05363406]
 [-1.177633   -0.75083014]
 [-0.14720413 -0.46965507]
 [ 0.60219869 -0.29662425]
 [ 0.13382193 -0.08033573]
 [ 1.16425081  0.46038556]
 [ 1.07057546  2.19069369]]

In [36]:
sc_34000 = (34000 - df1['Income'].mean())/df1['Income'].std(ddof = 0)
print(sc_34000)

-0.7508301370835625

In [39]:
#cross validation
from sklearn.model_selection import cross_val_score,KFold

In [40]:
x=np.array(['a','b','c','d','e','f','g','h','i','j'])
kf = KFold(n_splits=5)

for train,test in kf.split(x):
    print('Train',x[train],'Test',x[test])

Train ['c' 'd' 'e' 'f' 'g' 'h' 'i' 'j'] Test ['a' 'b']
Train ['a' 'b' 'e' 'f' 'g' 'h' 'i' 'j'] Test ['c' 'd']
Train ['a' 'b' 'c' 'd' 'g' 'h' 'i' 'j'] Test ['e' 'f']
Train ['a' 'b' 'c' 'd' 'e' 'f' 'i' 'j'] Test ['g' 'h']
Train ['a' 'b' 'c' 'd' 'e' 'f' 'g' 'h'] Test ['i' 'j']

In [41]:
x=np.array(['a','b','c','d','e','f','g','h','i','j'])
kf = KFold(n_splits=7)

for train,test in kf.split(x):
    print('Train',x[train],'Test',x[test])

Train ['c' 'd' 'e' 'f' 'g' 'h' 'i' 'j'] Test ['a' 'b']
Train ['a' 'b' 'e' 'f' 'g' 'h' 'i' 'j'] Test ['c' 'd']
Train ['a' 'b' 'c' 'd' 'g' 'h' 'i' 'j'] Test ['e' 'f']
Train ['a' 'b' 'c' 'd' 'e' 'f' 'h' 'i' 'j'] Test ['g']
Train ['a' 'b' 'c' 'd' 'e' 'f' 'g' 'i' 'j'] Test ['h']
Train ['a' 'b' 'c' 'd' 'e' 'f' 'g' 'h' 'j'] Test ['i']
Train ['a' 'b' 'c' 'd' 'e' 'f' 'g' 'h' 'i'] Test ['j']